Repository: common-repository/sl-user-create
Catalog: *-user-create-*.po
Languages: pt_pt

source: HTTP/1.0 405 Method Not Allowed
pt_pt: HTTP/1.0 405 Método não permitido

source: Request has to come from Second Life
pt_pt: O pedido tem de vir do Second Life

source: Invalid signature
pt_pt: Assinatura criptográfica inválida

source: Registration requires a valid avatar name and key
pt_pt: O registo requer um nome de avatar válido e respectiva chave

source: %s not allowed to register objects with %s
pt_pt: %s proibido de registar objectos em %s

source: %s banned from %s
pt_pt: %s banido de %s

source: Host %s (%s) is not allowed to register %s with %s
pt_pt: Servidor %s (%s) não está autorizado a registar %s em %s

source: HTTP/1.0 404 Function Not Found
pt_pt: HTTP/1.0 404 Função desconhecida

source: username_exists not found
pt_pt: username_exists não encontrado

source: HTTP/1.0 404 Not found
pt_pt: HTTP/1.0 404 Não encontrado

source: This object has never been registered to this WordPress site before!
pt_pt: Este objecto nunca se registou neste site WordPress!

source: Please contact the owner of %s
pt_pt: Por favor contacte o dono de %s

source: Registration to %s failed. Could not create a valid WP username out of your avatar name
pt_pt: Registo em %s falhou. Não foi possível criar um utilizador WP a partir do nome do avatar

source: Registered via "%s (%s)" (Shard: %s) - Object name: %s
pt_pt: Registado através de "%s (%s)" (Shard: %s) - Nome do objecto: %s

source: Registration to %s failed. Error: %s
pt_pt: Registo em %s falhou. Erro: %s

source: Registration on %s successful! Your login is %s (user id %d) with password %s
pt_pt: Registo em %s com sucesso! O seu login é %s (user id %d) com password %s

source: Password reset on %s successful! Your login is %s (user id %d) with password %s
pt_pt: Reset da password %s com sucesso! O seu login é %s (user id %d) com password %s

source: Host %s (%s) is not allowed to register objects with %s
pt_pt: Servidor %s (%s) não está autorizado a registar objectos em %s

source: PermURL <%s> saved for object '%s' (%s)
pt_pt: PermURL <%s> guardado para o objecto '%s' (%s)

source: No PermURL specified on registration
pt_pt: Nenhum PermURL especificado no registo

source: Script
pt_pt: Programa em LSL

source: Objects
pt_pt: Objectos

source: Security
pt_pt: Segurança

source: Instructions
pt_pt: Instruções

source: SL User Create
pt_pt: Criação de Utilizadores SL

source: No access.
pt_pt: Acesso inválido.

source: Deleting registration object:
pt_pt: Apagando objecto de registo:

source: Owned by
pt_pt: Dono:

source: Location:
pt_pt: Localização:

source: Sending llDie() to registration object:
pt_pt: Enviando llDie() ao objecto de registo:

source: Failed
pt_pt: Falhou

source: <strong>Not saved!!</strong><br \>
pt_pt: <strong>Não gravado!!</strong><br \>

source: Online registration objects <strong>deleted</strong>
pt_pt: Objectos de registo <strong>apagados</strong>

source: Current registration objects being tracked
pt_pt: Objectos de registo activos

source: Object Name
pt_pt: Nome do objecto

source: Object Key
pt_pt: Chave do objecto

source: Object Version
pt_pt: Versão do Objecto

source: Location
pt_pt: Localização

source: Avatar Owner Name
pt_pt: Nome (avatar) do dono

source: Avatar Owner Key
pt_pt: Chave (avatar) do dono

source: # avatars registered
pt_pt: Nº avatars registados

source: Last time checked
pt_pt: Última verificação

source: Del?
pt_pt: Apgr?

source: Registration object for
pt_pt: Objecto de registo para

source: Delete
pt_pt: Apagar

source: No registration objects are being tracked.
pt_pt: Nenhum objecto de registo activo.

source: Save Settings
pt_pt: Gravar opções

source: Error
pt_pt: Erro

source: This page should have never been displayed!
pt_pt: Esta página nunca deveria ser mostrada!

source: LSL Script
pt_pt: Programa em LSL

source: Secret string
pt_pt: Palavra secreta

source: Secret number
pt_pt: Número secreto

source: Disable Signature
pt_pt: Ignorar assinatura digital

source: Allowed avatars (for registration objects)
pt_pt: Avatares autorizados (a criar objectos de registo)

source: Banned avatars (from registering to the site)
pt_pt: Avatares banidos (de se registarem no site)

source: Allowed simulator DNS entries
pt_pt: Entradas de DNS de simuladores autorizados

source: Script for
pt_pt: Programa LSL para

source: Security options for
pt_pt: Opções para

source: 4-digit secret salt
pt_pt: 4 dígitos (PIN)

source: Disable signature check (less secure!)
pt_pt: Ignorar a assinatura digital que é enviada a partir do Second Life (menos seguro!)

source: Add avatar names allowed to use this script (empty means all are allowed), one per line
pt_pt: Acrescente nomes de avatares autorizados a usar este programa em LSL (vazio significa que todos estão autorizados), um por linha

source: Add avatar names banned from this site (empty means all are allowed), one per line
pt_pt: Acrescente nomes de avatares não autorizados a usar este programa em LSL (vazio significa que todos estão autorizados), um por linha

source: Add simulator DNS entries allowed to use this script (empty means all are allowed); partial entries are allowed, i. e. secondlife.com to allow registrations only from the SL Grid
pt_pt: Acrescente entradas de DNS para os simuladores autorizados a usar este programa de LSL (vazio significa que todos estão autorizados); são permitidas entradas parciais, por exemplo <em>secondlife.com</em> para autorizar registos apenas da <em>grid</em> SL

source: Please create an object in Second Life on a plot owned by you, and drop the following script inside:
pt_pt: Por favor crie um objecto no Second Life numa parcela sua, e coloque o seguinte programa no interior:

source: Need to automatically register new users on a WordPress site with their Second Life® avatar names? This plugin allows you to do so, by exhibiting a script that you can copy and place into an in-world object. Users just need to touch the object to get automatically registered; if they are already registered, they will just get a link to your site.
pt_pt: Precisa de registrar automaticamente novos utilizadiores num site WordPress com os nomes dos avatares de Second Life®? Este plugin permiteisso mesmo, com a exibição de um script que pode copiar e colocar num objecto criado no mundo virtual. Os utilizadores só precisam de tocar no objecto para se inscreverem automaticamente; se já estiverem registrados, receberão apenas um link para o seu site.

source: New users will receive a password via the Second Life Instant Messaging Service, as well as a link to tell them the URL for your site. The new profile will include their avatar name as a login and their SL profile picture (if available via Web) will become their WordPress profile picture. If you have some special meta fields enabled on your WordPress profile, they will be filled in with some data from SL as well (e.g. location).
pt_pt: Os novos utilizadores receberão uma senha através do Second Life Instant Messaging Service, bem como um link para lhes dizer qual o URL do seu site. O novo perfil vai incluir nome do avatar, assim como um login, e sua foto do perfil SL (se disponível via Web) será utilizada como a sua imagem de perfil no WordPress. Se tiver alguns campos adicionais activados no seu perfil WordPress, estes podem ser preenchidos com alguns dados do SL (como, por exemplo, a localização).

source: After installing the plugin, if you're using a cache manager (e.g. W3 Total Cache) make sure you add <strong>register-avatar.php</strong> and <strong>register-object.php</strong> to the exception list, or you'll get multiple registrations with the same name!
pt_pt: Depois de instalar o plugin, se estiver a usar um gestor de cache (por exemplo, W3 Total Cache) certifique-se de adicionar <strong>registar-avatar.php</strong> e <strong>register-object.php</strong> à lista de excepções; caso contrário, pode vir ter vários registros com o mesmo nome!

source: Go to the Settings menu and look at the option for "SL User Create". You should be shown a pre-formatted LSL script.
pt_pt: Vá ao menu Configurações e olhe para a opção de "Criação de Utilizadores SL". Dever-lhe-á ser mostrado um script LSL pré-formatado.

source: Launch Second Life.
pt_pt: Aranque o Second Life.

source: Create an object in your land. Make sure that scripts are active!
pt_pt: Crie um objecto numa parcela de terreno. Certifique-se de que os scripts estão activos nessa parcela!

source: Right-click to open the object's Build popup, and go to the Contents tab.
pt_pt: Clique com o botão direito do rato nesse objecto para abrir a caixa de diálogo "Build" (= construir), e clique na aba "Contents" (= conteúdo).

source: Create a new script inside (just click on the button).
pt_pt: Crie um novo script no interior do objecto (basta clicar no botão que aparece).

source: Delete everything in that script.
pt_pt: Apague tudo o que estiver nesse script.

source: Now go back to the WordPress admin page you've opened, and copy the script and paste it inside your LSL script in Second Life.
pt_pt: Agora volte à página de administração do WordPress deste plugin, e copie o script que lá está para dentro do script LSL no objecto criado no Second Life.

source: Save the LSL script in Second Life; it should recompile.
pt_pt: Grave o script LSL no Second Life; este deverá automaticamente ser recompilado.

source: The LSL script will now try to contact your blog and register itself.
pt_pt: O script LSL deverá de seguida tentar contactar o seu site e registar-se automaticamente.

source: Now any avatar wishing to register for their blog will only need to touch this object and get immediately registered. You can have multiple objects, on several sims, even on different grids, and owned by different users.
pt_pt: A partir de agora, qualquer avatar que se queira registar no seu site só precisa de clicar no objecto para ser automaticamente registado. Pode ter vários objectos em regiões diferentes, ou até mesmo em grids diferentes, em nome de diversos utilizadores.

source: Avatar names have to be unique across your blog, which means that the same user cannot register from different grids with the same name (but they can change the password if they forgot it, and don't need to log in back to their original grid).
pt_pt: Os nomes dos avatars têm de ser únicos por cada instalação de WordPress, o que significa que o mesmo utilizador não se pode registar de grids diferentes com o mesmo nome (mas, neste caso, podem mudar a password sem precisarem de voltar à grid original).

source: From 0.2.0 onwards there is a security page which allows a few options to limit access from potential hackers.
pt_pt: Da versão 0.2.0 em diante está disponível uma página de segurança com algumas opções para limitar o acesso a hackers potenciais.
